Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/edc/PIC32CM2532JH00032.PIC
      <edc:SFRDef edc:_addr="0x40000818" edc:access="--------------------------n--nnn" edc:cname="APBBMASK" edc:impl="0x27" edc:mclr="00000000000000000000000000000111" edc:nzwidth="0x20" edc:por="00000000000000000000000000000111" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:desc="HMATRIXHS APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000081C" edc:access="----nnn--nnnnnnnnnnnnnn----nnnnn" edc:cname="APBCMASK" edc:impl="0xE7FFE1F" edc:mclr="00001000000000000000000000000000" edc:nzwidth="0x20" edc:por="00001000000000000000000000000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC1_" edc:desc="TCC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC2_" edc:desc="TCC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC0_" edc:desc="ADC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC1_" edc:desc="ADC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ICM_" edc:desc="ICM APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PDEC_" edc:desc="PDEC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMBIST_" edc:desc="SMBIST APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000820" edc:access="---------------------------nnn--" edc:cname="APBDMASK" edc:impl="0x1C" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCLK">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:desc="TC5 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC6_" edc:desc="TC6 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC7_" edc:desc="TC7 APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000824" edc:offset="0x3DC"/>
      <edc:SFRDef edc:_addr="0x40000C00" edc:access="-rrr-rrr" edc:cname="RCAUSE" edc:impl="0x77" edc:nzwidth="0x8" ltx:memberofperipheral="RSTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="RSTC">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="Power On Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODCORE" edc:desc="Brown Out CORE Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BODVDD" edc:desc="Brown Out VDD Detector Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:desc="Watchdog Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:desc="System Reset Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000C01" edc:offset="0x3FF"/>
      <edc:SFRDef edc:_addr="0x40001000" edc:access="--------------------nnnn---n--nn" edc:cname="INTENCLR" edc:impl="0xF13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:desc="OSC48M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Time Out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Ratio Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001004" edc:access="--------------------nnnn---n--nn" edc:cname="INTENSET" edc:impl="0xF13" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSCFAIL" edc:desc="XOSC Clock Failure Detector Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OSC48MRDY" edc:desc="OSC48M Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKR" edc:desc="DPLL Lock Rise Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLCKF" edc:desc="DPLL Lock Fall Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLTO" edc:desc="DPLL Time Out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLLDRTO" edc:desc="DPLL Ratio Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
