Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/edc/PIC32CM2532JH00032.PIC
      <edc:SFRDef edc:_addr="0x40001CB8" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL14" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CBC" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL15" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CC0" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL16" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CC4" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL17" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CC8" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL18" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CCC" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL19" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CD0" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL20" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001CD4" edc:access="------------------------nn--nnnn" edc:cname="PCHCTRL21" edc:impl="0xCF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GCLK">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="GEN" edc:desc="Generic Clock Generator" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="GCLK6" edc:desc="Generic clock generator 6" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="GCLK7" edc:desc="Generic clock generator 7" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="GCLK8" edc:desc="Generic clock generator 8" edc:when="(field &amp; 0xF) == 0x8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHEN" edc:desc="Channel Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
