Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.72/PIC32CM-JH00/edc/PIC32CM2532JH00032.PIC
      <edc:SFRDef edc:_addr="0x40002C0A" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Measurement Done" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C0B" edc:access="------nn" edc:cname="STATUS" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="FREQM Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Sticky Count Value Overflow" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C0C" edc:access="------------------------------rr" edc:cname="SYNCBUSY" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40002C10" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="VALUE" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="FREQM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="FREQM">
            <edc:SFRFieldDef edc:cname="VALUE" edc:desc="Measurement Value" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40002C14" edc:offset="0x3EC"/>
      <edc:SFRDef edc:_addr="0x40003000" edc:access="------------------------------nn" edc:cname="CTRLA" edc:impl="0x3" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="No effect." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ECC Decoder Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="ECC decoding is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="ECC decoding is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40003004" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x40003008" edc:access="------------------------------nn" edc:cname="INTENCLR" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERREN" edc:desc="Single Bit Error Interrupt Enable, Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DERREN" edc:desc="Double Bit Error Interrupt Enable, Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000300C" edc:access="------------------------------nn" edc:cname="INTENSET" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERREN" edc:desc="Single Bit Error Interrupt Enable, Set" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DERREN" edc:desc="Double Bit Error Interrupt Enable, Set" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003010" edc:access="------------------------------nn" edc:cname="INTSTA" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="SERR" edc:desc="Single Bit Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DERR" edc:desc="Double Bit Error" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003014" edc:access="------------------nn----------n-" edc:cname="FLTCTRL" edc:impl="0x3002" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FLTEN" edc:desc="Fault Injection Enabled" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Disables fault injection." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="FLTMD" edc:desc="Fault Injection Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Fault Injection Disabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="Single Fault Injection at bit selected by FLTPTR.FTL1PTR" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DOUBLE" edc:desc="Double Fault Injection at bits FLTPTR.FTL1PTR and FLTPTR.FTL2PTR" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003018" edc:access="--------nnnnnnnn--------nnnnnnnn" edc:cname="FLTPTR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="FLT1PTR" edc:desc="Single Fault Injection Bit Pointer" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="FLT2PTR" edc:desc="Double Fault Injection Bit Pointer" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000301C" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="FLTADR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="FLTADR" edc:desc="Fault Address Offset" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003020" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ERRCADR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCADR" edc:desc="ECC SECDED Error Capture Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003024" edc:access="-------------------------rrrrrrr" edc:cname="ERRCPAR" edc:impl="0x7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCPAR" edc:desc="ECC SECDED Error Capture Parity" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40003028" edc:access="----------------rr-------rrrrrrr" edc:cname="ERRCSYN" edc:impl="0xC07F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MCRAMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MCRAMC">
            <edc:SFRFieldDef edc:cname="ERCSYN" edc:desc="ECC SECDED Error Capture Syndrome" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Not a Single bit error." edc:when="(field &amp; 0x7F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Single bit error." edc:when="(field &amp; 0x7F) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ERR1" edc:desc="ECC Single Bit Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR2" edc:desc="ECC Double Bit Error" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="Not a Double bit error." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="Double bit error." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x41000000" edc:endaddr="0x41009000" edc:regionid="HPB1" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x41000000" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP0DIR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Port Data Direction" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41000004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP0DIRCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="DIRCLR" edc:desc="Port Data Direction Clear" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
